---
kind: other
id: Properties.T:Autodesk.Revit.DB.AssemblyDifferenceNamingCategory
source: html/5394d87e-eb41-cc76-12af-16515b56253f.htm
---
# AssemblyDifferenceNamingCategory Properties

Specifies whether the .NET object represents a valid Revit entity.